
&НаСервере
Процедура ГУИДСтрокаПриИзмененииНаСервере()
	
	//3d038aa2-b152-11ea-a507-a85e455f231e
	
	МассивЧастиЗапроса = Новый Массив;
	Запрос = Новый Запрос;
	ШаблонЗапроса = "ВЫБРАТЬ
	|	т.Ссылка
	|ИЗ
	|	Документ.%ИмяДокумента% КАК т
	|ГДЕ
	|	т.Ссылка = &%ИмяДокумента% Ссылка";
	
	Для каждого ОбъектМетаданные Из Метаданные.Документы Цикл
		
		МассивЧастиЗапроса.Добавить(
			СтрЗаменить(ШаблонЗапроса, "%ИмяДокумента%", ОбъектМетаданные.Имя)); 
			
		Запрос.УстановитьПараметр(ОбъектМетаданные.Имя + "Ссылка",
			Документы[ОбъектМетаданные.Имя].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДСтрока)));
	КонецЦикла;
	
	Если МассивЧастиЗапроса.Количество() > 0 Тогда
		
		Запрос.Текст = СтрСоединить(МассивЧастиЗапроса, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Ссылка = РезультатЗапроса.Выгрузить()[1].Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГУИДСтрокаПриИзменении(Элемент)
	ГУИДСтрокаПриИзмененииНаСервере();
КонецПроцедуры
